arduino/ArduinoCore-zephyr/boards.txt
rpi_pico.build.float-abi=-mfloat-abi=soft
rpi_pico.build.extra_flags=
rpi_pico.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
rpi_pico.recipe.hooks.objcopy.postobjcopy.3.pattern="{runtime.platform.path}/extra/bin2uf2/bin2uf2" "{build.path}/{build.project_name}.elf-zsk.bin" "{build.path}/{build.project_name}.uf2"
rpi_pico.build.architecture=cortex-m0plus
rpi_pico.build.board=RASPBERRY_PI_PICO
rpi_pico.compiler.zephyr=
rpi_pico.vid.0=0x2e8a
rpi_pico.pid.0=0x00C0
rpi_pico.upload_port.0.vid=0x2e8a
rpi_pico.upload_port.0.pid=0x00C0

rpi_pico.upload.tool=picotool
rpi_pico.upload.tool.default=picotool
rpi_pico.upload.protocol=
rpi_pico.upload.transport=
rpi_pico.upload.vid=0x2e8a
rpi_pico.upload.pid=0x00C0
rpi_pico.upload.interface=0
rpi_pico.upload.use_1200bps_touch=true
rpi_pico.upload.wait_for_upload_port=false
rpi_pico.upload.native_usb=true
rpi_pico.upload.maximum_size=2097152
rpi_pico.upload.maximum_data_size=270336

rpi_pico.upload.address=0x100E0000

rpi_pico.bootloader.tool=picotool
rpi_pico.bootloader.tool.default=picotool
rpi_pico.bootloader.vid=0x2e8a
rpi_pico.bootloader.pid=0x00C0
rpi_pico.bootloader.interface=0
rpi_pico.bootloader.file=zephyr-{build.variant}


rpi_pico.debug.tool=gdb
rpi_pico.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
rpi_pico.debug.server.openocd.scripts.1={programmer.transport_script}
rpi_pico.debug.server.openocd.scripts.2=target/rp2040-core0.cfg
rpi_pico.debug.cortex-debug.custom.request=attach
rpi_pico.debug.svd_file={runtime.platform.path}/svd/rp2040.svd

##############################################################################################################
